Requests_control/src/Catalogs/Обращения/Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Обращения</name>
  <attributes>
    <name>ВидОбращения</name>
    <type>
      <types>CatalogRef.ВидыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеВопросыНаРассмотрении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоОбращению</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Заявители</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ОрганыИУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбратившихся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотрения</name>
    <comment>Плановый срок рассмотрения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотренияПервоначальный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящаяДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящийНомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОМерах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОРезультатах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганДляПередачи</name>
      <type>
        <types>CatalogRef.ОрганыИУчреждения</types>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатРассмотрения</name>
      <type>
        <types>EnumRef.РезультатыРассмотрения</types>
      </type>
    </attributes>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.Темы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тематика</name>
      <type>
        <types>CatalogRef.Тематики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/Enums/ТипыОбращений/ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбращений</name>
  <enumValues>
    <name>Персональное</name>
  </enumValues>
  <enumValues>
    <name>Коллективное</name>
  </enumValues>
  <enumValues>
    <name>Анонимное</name>
  </enumValues>
</mdclass:Enum>

Requests_control/src/Catalogs/Обращения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		ДатаПоступления = ТекущаяДатаСеанса();
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаПоступления = ТекущаяДатаСеанса();
	
	ДатаДокумента = ТекущаяДатаСеанса();
	НомерДокумента = "";
	ВсеВопросыНаРассмотрении = Ложь;
	ДатаПоОбращению = Неопределено;
	Источник = Неопределено;
	Источник = Неопределено;
	Источник = Неопределено;
	Источник = Неопределено;
	СрокРассмотренияПервоначальный = Неопределено;
	
	Для Каждого СтрокаВопрос Из Вопросы Цикл 
		СтрокаВопрос.ДатаОтвета = Неопределено;
		СтрокаВопрос.ИсходящаяДатаДокумента = Неопределено;
		СтрокаВопрос.ИсходящийНомерДокумента = Неопределено;
		СтрокаВопрос.ОрганДляПередачи = Неопределено;
		СтрокаВопрос.РезультатРассмотрения = Неопределено;
		СтрокаВопрос.МнениеАвтораОРезультатах = Неопределено;
		СтрокаВопрос.МнениеАвтораОМерах = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда 
		Если КоличествоСеансовИнформационнойБазы() > 1 Тогда 
			ВызватьИсключение НСтр("ru = 'Базовая версия не поддерживает одновременную работу нескольких пользователей.'");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = Справочники.Обращения.ПолучитьНаименованиеОбъекта(ЭтотОбъект);
	Если Не ЗначениеЗаполнено(СрокРассмотренияПервоначальный) И ЗначениеЗаполнено(СрокРассмотрения) Тогда 
		СрокРассмотренияПервоначальный = СрокРассмотрения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПредыдущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"ПометкаУдаления, Ответственный");
	Иначе
		ПредыдущиеЗначенияРеквизитов = Новый Структура;
		ПредыдущиеЗначенияРеквизитов.Вставить("ПометкаУдаления", Ложь);
		ПредыдущиеЗначенияРеквизитов.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	КонецЕсли;
	
	Если ПометкаУдаления И ПометкаУдаления <> ПредыдущиеЗначенияРеквизитов.ПометкаУдаления Тогда
		ДополнительныеСвойства.Вставить("УстановленаПометкаУдаления");
	КонецЕсли;
	
	Если Ответственный <> ПредыдущиеЗначенияРеквизитов.Ответственный Тогда
		ДополнительныеСвойства.Вставить("ИзменилсяОтветственный");
	КонецЕсли;
	
	// Пометка на удаление приложенных файлов.
	Если ПометкаУдаления <> ПредыдущиеЗначенияРеквизитов.ПометкаУдаления Тогда 
		
		РаботаСФайламиВызовСервера.ПометитьНаУдалениеПриложенныеФайлы(Ссылка, ПометкаУдаления);
		
	КонецЕсли;
	
	Если Вопросы.Количество() = 0 Тогда
		Отработано = Ложь;
		ВсеВопросыНаРассмотрении = Ложь;
	Иначе	
		
		ВсеВопросыОтработаны = Истина;
		ВсеВопросыНаРассмотрении = Истина;
		
		Для Каждого Вопрос Из Вопросы Цикл
			
			Если Не ЗначениеЗаполнено(Вопрос.РезультатРассмотрения) Тогда
				
				ВсеВопросыОтработаны = Ложь;
				
			Иначе 
				
				ВсеВопросыНаРассмотрении = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Отработано = ВсеВопросыОтработаны;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("УстановленаПометкаУдаления") Тогда
		Справочники.Сообщения.ПометитьНаУдалениеПоПредмету(Ссылка);
	КонецЕсли;
	
	Если ТребуетсяСообщитьОтветственномуОНазначении() Тогда
		РаботаССообщениями.ДобавитьСообщениеОНазначенииОтветственным(Ответственный, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЧисловойНомер > 0 Тогда
		СтруктураПараметров = НумерацияКлиентСервер.ПолучитьПараметрыНумерации(ЭтотОбъект);
		Нумерация.ОсвободитьНомер(СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипОбращения <> Перечисления.ТипыОбращений.Анонимное Тогда 
		ПроверяемыеРеквизиты.Добавить(ВидОбращения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерДокумента) И ЗначениеЗаполнено(ДатаДокумента) Тогда 
		Если Не РаботаСОбращениями.НомерДокументаУникален(ЭтотОбъект) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Номер документа не уникален!'"),
				ЭтотОбъект,
				"НомерДокумента",, 
				Отказ);
		КонецЕсли;	
	КонецЕсли;
	
	//Проверка табличной части Вопросы на заполненность
	КоличествоВопросов = Вопросы.Количество();
	Если КоличествоВопросов > 1 Тогда
		Для Индекс = 1 По КоличествоВопросов - 1 Цикл
			Если Не ЗначениеЗаполнено(Вопросы[Индекс].Вопрос) Тогда 
				ТекстСообщения = НСтр("ru = '""Классификация"" не заполнена'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,
					"Вопросы["+ Формат(Индекс, "ЧН=0; ЧГ=0") +"]",,Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция КоличествоСеансовИнформационнойБазы(УчитыватьКонсоль = Истина, УчитыватьФоновыеЗадания = Истина) Экспорт
	
	Результат = 0;
	
	СеансыИБ = ПолучитьСеансыИнформационнойБазы();
	Для Каждого СеансИБ Из СеансыИБ Цикл
		Если СеансИБ.ИмяПриложения = "SrvrConsole"
		 Или СеансИБ.ИмяПриложения = "BackgroundJob" 
		 Или СеансИБ.ИмяПриложения = "Designer" Тогда
			Продолжить;
		КонецЕсли;
		Результат = Результат + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, необходимо ли сообщить ответственному о назначении.
Функция ТребуетсяСообщитьОтветственномуОНазначении()
	
	ТребуетсяСообщитьОтветственномуОНазначении =
		ДополнительныеСвойства.Свойство("ИзменилсяОтветственный")
		И ПометкаУдаления = Ложь
		И Отработано = Ложь
		И ЗначениеЗаполнено(Ответственный)
		И Ответственный <> ПользователиКлиентСервер.ТекущийПользователь();
	
	Возврат ТребуетсяСообщитьОтветственномуОНазначении;
	
КонецФункции

#КонецЕсли
